Documents/ОприходованиеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ОприходованиеЗапасов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Склады</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Склад оприходования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенкулатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>НДС по ставке  18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>НДС по ставке 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>НДС по ставке 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>Без НДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>НДС по ставке 10%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОприходованиеЗапасов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗапасыСуммаПриИзмененииНаСервере()
	Для каждого СтрокаТЧ Из Объект.Запасы Цикл
        СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	ЗапасыСуммаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	ЗапасыСуммаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	ЗапасыСуммаПриИзмененииНаСервере();
КонецПроцедуры




&НаСервере
Функция ПолучитьПроцентСтавкиНДС(СтавкаНДС) 
	ПроцентНДС = 0;
    
    Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
        ПроцентНДС = 18;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
        ПроцентНДС = 0;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
        ПроцентНДС = 20;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
        ПроцентНДС = 0;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
        ПроцентНДС = 10;
    КонецЕсли;
    
    Возврат ПроцентНДС;
КонецФункции


&НаСервере
Процедура ЗапасыСуммаНДСПриИзмененииНаСервере()
	Для каждого СтрокаТЧ Из Объект.Запасы Цикл
        СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;    
		ПроцентНДС = ПолучитьПроцентСтавкиНДС(СтрокаТЧ.НДС) / 100;
		СтрокаТЧ.СуммаНДС = СтрокаТЧ.Сумма * ПроцентНДС;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении(Элемент)
	ЗапасыСуммаНДСПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНДСПриИзменении(Элемент)
	ЗапасыСуммаНДСПриИзмененииНаСервере();
КонецПроцедуры



&НаСервере
Процедура ЗапасыПриИзмененииНаСервере()
	Для каждого СтрокаТЧ Из Объект.Запасы Цикл
        СтрокаТЧ.Всего = СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	ЗапасыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры
